<a href="https://colab.research.google.com/github/noushadkhan01/kansepur-flyash-project/blob/master/1-14-feb-bill5/1_14_feb_bill5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!git clone https://github.com/noushadkhan01/kansepur-flyash-project.git

Cloning into 'kansepur-flyash-project'...
remote: Enumerating objects: 51, done.
remote: Counting objects: 100% (51/51), done.
remote: Compressing objects: 100% (48/48), done.
remote: Total 291 (delta 21), reused 0 (delta 0), pack-reused 240
Receiving objects: 100% (291/291), 686.74 KiB | 17.17 MiB/s, done.
Resolving deltas: 100% (129/129), done.

In [0]:
import pandas as pd

In [3]:
%cd ./kansepur-flyash-project/1-14-feb-bill5/

/content/kansepur-flyash-project/1-14-feb-bill5

In [4]:
!ls

1_14_feb_bill5.ipynb  1_14_feb_bill.xlsx

In [5]:
df = pd.read_excel('1_14_feb_bill.xlsx', 'Sheet1')
df.head()

   S.No.       Date  Counts      Name  Quantity  Diesel
0    1.0 2019-02-01     1.0  khurseed       455     NaN
1    2.0        NaT     2.0     momin       415     NaN
2    3.0        NaT     3.0     jabir       419     NaN
3    4.0        NaT     4.0   farookh       420     NaN
4    5.0        NaT     5.0    haseen       496     NaN

In [6]:
df.tail(2)

     S.No.       Date  Counts   Name  Quantity  Diesel
270  271.0 2019-02-14     NaN  jabir       419     NaN
271    NaN        NaT     NaN    NaN    120389     NaN

In [7]:
df = df[:-1]
df.tail(1)

     S.No.       Date  Counts   Name  Quantity  Diesel
270  271.0 2019-02-14     NaN  jabir       419     NaN

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271 entries, 0 to 270
Data columns (total 6 columns):
S.No.       271 non-null float64
Date        10 non-null datetime64[ns]
Counts      270 non-null float64
Name        271 non-null object
Quantity    271 non-null int64
Diesel      0 non-null float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(1)
memory usage: 12.8+ KB

In [9]:
unique_dates = df.Date.unique()
unique_dates = pd.Series(unique_dates).dropna()
print(unique_dates)

0    2019-02-01
2    2019-02-02
3    2019-02-05
4    2019-02-06
5    2019-02-07
6    2019-02-10
7    2019-02-11
8    2019-02-12
9    2019-02-13
10   2019-02-14
dtype: datetime64[ns]

In [10]:
df.Date.nunique()

10

In [11]:
df.Date.value_counts()

2019-02-07    1
2019-02-10    1
2019-02-13    1
2019-02-02    1
2019-02-05    1
2019-02-11    1
2019-02-14    1
2019-02-06    1
2019-02-12    1
2019-02-01    1
Name: Date, dtype: int64

In [0]:
import numpy as np

In [13]:
df.Name.unique()

array(['khurseed', 'momin', 'jabir', 'farookh', 'haseen', 'rasid',
       'isran', 'aarif', 'hasan', 'rafakat', 'shokeen', 'amjad', 'toheed',
       'shabir', 'aashu', 'mehmood', 'mustakim', 'gulfam', 'wajid',
       'irsad'], dtype=object)

In [73]:
total_quantity = sum(df.Quantity)
total_quantity

120389

In [63]:
rounds_per_name = df.Name.value_counts()
rounds_per_name

jabir       25
khurseed    21
haseen      20
momin       17
isran       17
aarif       17
hasan       16
rasid       16
mustakim    15
toheed      15
mehmood     15
wajid       13
farookh     13
amjad       12
shokeen     11
gulfam      10
irsad        9
rafakat      4
shabir       3
aashu        2
Name: Name, dtype: int64

## unique feets per name

In [16]:
group = df.groupby(df.Name)
group

In [17]:
for i, j in group:
  print(i, '\n', j.Quantity, '\n')

aarif
 7      416
21     416
28     416
46     416
54     416
63     416
75     416
85     416
98     416
118    416
169    416
184    416
199    416
208    416
214    416
226    416
258    416
Name: Quantity, dtype: int64

aashu
 15    430
26    430
Name: Quantity, dtype: int64

amjad
 11     411
32     411
44     411
57     411
64     411
79     411
90     411
100    411
119    411
222    411
235    411
250    411
Name: Quantity, dtype: int64

farookh
 3      420
24     420
35     420
111    420
127    420
142    420
152    420
168    420
191    420
213    420
227    420
241    420
257    420
Name: Quantity, dtype: int64

gulfam
 76     500
91     500
114    500
129    500
144    480
176    500
221    500
238    500
247    500
255    500
Name: Quantity, dtype: int64

hasan
 8      538
22     538
41     538
50     538
80     538
89     538
102    538
112    538
134    538
175    538
194    538
206    538
215    538
230    538
245    538
261    518
Name: Quantity, dtype: int64

haseen
 4      496
18     496
27     496
52     496
61     496
78     496
93     496
104    496
121    496
125    496
138    496
149    496
160    496
173    496
187    496
202    496
220    496
233    496
246    496
263    496
Name: Quantity, dtype: int64

irsad
 106    435
122    435
182    435
196    435
207    415
224    435
237    435
252    435
262    415
Name: Quantity, dtype: int64

isran
 6      470
43     470
55     470
67     470
73     470
84     470
99     470
117    470
135    470
146    470
157    470
171    470
185    470
217    470
228    470
248    470
266    470
Name: Quantity, dtype: int64

jabir
 2      419
14     419
25     419
39     419
58     419
66     419
72     419
83     419
94     419
105    419
110    419
123    399
128    419
137    419
147    419
158    419
167    419
181    419
212    419
225    419
239    419
242    419
253    419
264    419
270    419
Name: Quantity, dtype: int64

khurseed
 0      455
20     455
33     455
42     455
49     455
60     455
69     435
77     455
88     455
96     455
116    455
132    455
141    435
153    455
170    455
186    455
198    455
210    455
216    455
234    455
259    455
Name: Quantity, dtype: int64

mehmood
 37     538
40     430
59     538
70     496
107    410
108    455
161    420
162    455
164    405
172    410
188    500
200    470
205    453
267    405
268    500
Name: Quantity, dtype: int64

momin
 1      415
17     415
31     415
51     415
65     415
81     415
92     415
130    415
139    405
151    415
163    415
174    415
189    415
218    415
232    415
244    415
265    415
Name: Quantity, dtype: int64

mustakim
 71     405
86     405
97     405
109    405
126    405
140    405
155    405
166    405
183    405
197    405
209    405
211    405
229    405
240    405
254    405
Name: Quantity, dtype: int64

rafakat
 9     538
16    538
30    538
62    538
Name: Quantity, dtype: int64

rasid
 5      410
19     410
29     410
48     410
56     410
68     410
74     410
87     410
95     410
113    410
124    410
136    390
148    410
180    410
193    410
204    410
Name: Quantity, dtype: int64

shabir
 13    470
23    470
34    470
Name: Quantity, dtype: int64

shokeen
 10     453
38     453
45     453
131    453
143    453
154    453
165    453
179    453
195    453
243    453
260    453
Name: Quantity, dtype: int64

toheed
 12     320
36     320
47     320
53     320
101    455
120    405
133    455
145    445
156    445
178    455
190    455
203    455
223    455
231    455
251    455
Name: Quantity, dtype: int64

wajid
 82     419
103    419
115    409
150    419
159    419
177    419
192    419
201    419
219    419
236    419
249    419
256    419
269    419
Name: Quantity, dtype: int64

In [18]:
for i, j in group:
  print(i, j.Quantity.unique(), '\n')

aarif [416]

aashu [430]

amjad [411]

farookh [420]

gulfam [500 480]

hasan [538 518]

haseen [496]

irsad [435 415]

isran [470]

jabir [419 399]

khurseed [455 435]

mehmood [538 430 496 410 455 420 405 500 470 453]

momin [415 405]

mustakim [405]

rafakat [538]

rasid [410 390]

shabir [470]

shokeen [453]

toheed [320 455 405 445]

wajid [419 409]

# Diesel

In [11]:
diesel = pd.read_excel('1_14_feb_bill.xlsx', 'Diesel')
diesel.head()

        Date   Name  Diesel    cash
0 2019-02-01  hasan    2000     NaN
1        NaT  aarif    2000     NaN
2        NaT  jabir    2000     NaN
3        NaT  aashu    1500  1000.0
4        NaT  rasid    1500     NaN

In [12]:
diesel.shape

(125, 4)

In [13]:
diesel.Date.unique()

array(['2019-02-01T00:00:00.000000000',                           'NaT',
       '2019-02-02T00:00:00.000000000', '2019-02-05T00:00:00.000000000',
       '2019-02-06T00:00:00.000000000', '2019-02-07T00:00:00.000000000',
       '2019-02-10T00:00:00.000000000', '2019-02-11T00:00:00.000000000',
       '2019-02-12T00:00:00.000000000', '2019-02-13T00:00:00.000000000'],
      dtype='datetime64[ns]')

In [0]:
for n, i in enumerate(diesel.Date.values):
  if not pd.isnull(i):
    date = i
  else:
    diesel.iloc[n, 0] = date

In [15]:
diesel.head()

        Date   Name  Diesel    cash
0 2019-02-01  hasan    2000     NaN
1 2019-02-01  aarif    2000     NaN
2 2019-02-01  jabir    2000     NaN
3 2019-02-01  aashu    1500  1000.0
4 2019-02-01  rasid    1500     NaN

# pivot table

In [16]:
pivot_diesel = diesel.pivot_table(index = 'Name', columns = 'Date', values = 'Diesel')
pivot_diesel

Date,2019-02-01 00:00:00,2019-02-02 00:00:00,2019-02-05 00:00:00,2019-02-06 00:00:00,2019-02-07 00:00:00,2019-02-10 00:00:00,2019-02-11 00:00:00,2019-02-12 00:00:00,2019-02-13 00:00:00
Name,,,,,,,,,
Total,43500.0,3000.0,32000.0,30000.0,21000.0,32000.0,38000.0,36500.0,30000.0
aarif,2000.0,NaN,2000.0,2000.0,NaN,NaN,2000.0,2500.0,1500.0
aashu,1500.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
amjad,NaN,NaN,2000.0,2000.0,1000.0,NaN,NaN,2000.0,NaN
farookh,1500.0,NaN,NaN,NaN,NaN,2000.0,2000.0,1500.0,2000.0
gulfam,NaN,NaN,NaN,2000.0,2000.0,2000.0,NaN,2000.0,2000.0
hasan,2000.0,1000.0,1500.0,1500.0,NaN,2000.0,2000.0,1500.0,1000.0
haseen,2000.0,NaN,2000.0,2000.0,1500.0,2000.0,2500.0,1500.0,1500.0
irsad,NaN,NaN,NaN,500.0,2000.0,NaN,2000.0,2000.0,1500.0
isran,NaN,NaN,2000.0,2000.0,1000.0,2000.0,2000.0,2000.0,1500.0
jabir,2000.0,NaN,2000.0,2000.0,1000.0,2000.0,2500.0,1500.0,2000.0
khurseed,NaN,2000.0,2000.0,1300.0,NaN,2000.0,2000.0,2000.0,NaN
momin,2000.0,NaN,2000.0,1270.0,NaN,1500.0,NaN,2000.0,1500.0
mustakim,NaN,NaN,NaN,1500.0,NaN,2000.0,2000.0,2000.0,1500.0
noushad,9500.0,NaN,4240.0,3430.0,4000.0,4000.0,7500.0,6500.0,8500.0
poclain,3500.0,NaN,5260.0,5000.0,4000.0,3500.0,3000.0,3500.0,NaN
rafakat,2000.0,NaN,2000.0,NaN,NaN,NaN,NaN,NaN,NaN
rasid,1500.0,NaN,1500.0,1500.0,NaN,2000.0,2000.0,NaN,NaN
sabir jcb,10000.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
sanjay,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2500.0
shabir,2000.0,0.0,NaN,NaN,2500.0,NaN,NaN,NaN,NaN
shokeen,NaN,NaN,2000.0,NaN,NaN,1500.0,2000.0,NaN,1500.0
toheed,2000.0,NaN,1500.0,NaN,NaN,2000.0,2500.0,1500.0,NaN
wajid,NaN,NaN,NaN,2000.0,2000.0,1000.0,2000.0,2500.0,1500.0

In [0]:
pivot_diesel.fillna(value = 0, inplace = True)

In [18]:
pivot_diesel.head(2)

Date,2019-02-01 00:00:00,2019-02-02 00:00:00,2019-02-05 00:00:00,2019-02-06 00:00:00,2019-02-07 00:00:00,2019-02-10 00:00:00,2019-02-11 00:00:00,2019-02-12 00:00:00,2019-02-13 00:00:00
Name,,,,,,,,,
Total,43500.0,3000.0,32000.0,30000.0,21000.0,32000.0,38000.0,36500.0,30000.0
aarif,2000.0,0.0,2000.0,2000.0,0.0,0.0,2000.0,2500.0,1500.0

In [19]:
pivot_diesel['Total Diesel'] = pd.Series([0 for i in range(len(pivot_diesel))])
pivot_diesel.head(1)

Date,2019-02-01 00:00:00,2019-02-02 00:00:00,2019-02-05 00:00:00,2019-02-06 00:00:00,2019-02-07 00:00:00,2019-02-10 00:00:00,2019-02-11 00:00:00,2019-02-12 00:00:00,2019-02-13 00:00:00,Total Diesel
Name,,,,,,,,,,
Total,43500.0,3000.0,32000.0,30000.0,21000.0,32000.0,38000.0,36500.0,30000.0,NaN

In [0]:
for i in range(len(pivot_diesel)):
  pivot_diesel['Total Diesel'][i] = sum(pivot_diesel.iloc[i, 0:-1])

In [21]:
pivot_diesel

Date,2019-02-01 00:00:00,2019-02-02 00:00:00,2019-02-05 00:00:00,2019-02-06 00:00:00,2019-02-07 00:00:00,2019-02-10 00:00:00,2019-02-11 00:00:00,2019-02-12 00:00:00,2019-02-13 00:00:00,Total Diesel
Name,,,,,,,,,,
Total,43500.0,3000.0,32000.0,30000.0,21000.0,32000.0,38000.0,36500.0,30000.0,266000.0
aarif,2000.0,0.0,2000.0,2000.0,0.0,0.0,2000.0,2500.0,1500.0,12000.0
aashu,1500.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1500.0
amjad,0.0,0.0,2000.0,2000.0,1000.0,0.0,0.0,2000.0,0.0,7000.0
farookh,1500.0,0.0,0.0,0.0,0.0,2000.0,2000.0,1500.0,2000.0,9000.0
gulfam,0.0,0.0,0.0,2000.0,2000.0,2000.0,0.0,2000.0,2000.0,10000.0
hasan,2000.0,1000.0,1500.0,1500.0,0.0,2000.0,2000.0,1500.0,1000.0,12500.0
haseen,2000.0,0.0,2000.0,2000.0,1500.0,2000.0,2500.0,1500.0,1500.0,15000.0
irsad,0.0,0.0,0.0,500.0,2000.0,0.0,2000.0,2000.0,1500.0,8000.0
isran,0.0,0.0,2000.0,2000.0,1000.0,2000.0,2000.0,2000.0,1500.0,12500.0
jabir,2000.0,0.0,2000.0,2000.0,1000.0,2000.0,2500.0,1500.0,2000.0,15000.0
khurseed,0.0,2000.0,2000.0,1300.0,0.0,2000.0,2000.0,2000.0,0.0,11300.0
momin,2000.0,0.0,2000.0,1270.0,0.0,1500.0,0.0,2000.0,1500.0,10270.0
mustakim,0.0,0.0,0.0,1500.0,0.0,2000.0,2000.0,2000.0,1500.0,9000.0
noushad,9500.0,0.0,4240.0,3430.0,4000.0,4000.0,7500.0,6500.0,8500.0,47670.0
poclain,3500.0,0.0,5260.0,5000.0,4000.0,3500.0,3000.0,3500.0,0.0,27760.0
rafakat,2000.0,0.0,2000.0,0.0,0.0,0.0,0.0,0.0,0.0,4000.0
rasid,1500.0,0.0,1500.0,1500.0,0.0,2000.0,2000.0,0.0,0.0,8500.0
sabir jcb,10000.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,10000.0
sanjay,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,2500.0,2500.0
shabir,2000.0,0.0,0.0,0.0,2500.0,0.0,0.0,0.0,0.0,4500.0
shokeen,0.0,0.0,2000.0,0.0,0.0,1500.0,2000.0,0.0,1500.0,7000.0
toheed,2000.0,0.0,1500.0,0.0,0.0,2000.0,2500.0,1500.0,0.0,9500.0
wajid,0.0,0.0,0.0,2000.0,2000.0,1000.0,2000.0,2500.0,1500.0,11000.0

In [74]:
total_diesel = pivot_diesel.iloc[0, -1]
total_diesel

266000.0

# Total Quantity per name

In [0]:
name_groups = df.groupby('Name')
name_total_quantity = pd.DataFrame(columns = ['Name', 'Total Quantity'])
for i, j in name_groups:
  name_total_quantity = name_total_quantity.append({'Name':i, 'Total Quantity': sum(j.Quantity)}, ignore_index = True)
  
name_total_quantity.sort_values(by = ['Total Quantity'], ascending = False, inplace = True)

In [23]:
name_total_quantity

        Name Total Quantity
9      jabir          10455
6     haseen           9920
10  khurseed           9515
5      hasan           8588
8      isran           7990
0      aarif           7072
12     momin           7045
11   mehmood           6885
15     rasid           6540
18    toheed           6215
13  mustakim           6075
3    farookh           5460
19     wajid           5437
17   shokeen           4983
4     gulfam           4980
2      amjad           4932
7      irsad           3875
14   rafakat           2152
16    shabir           1410
1      aashu            860

In [24]:
pivot_diesel.head(1)

Date,2019-02-01 00:00:00,2019-02-02 00:00:00,2019-02-05 00:00:00,2019-02-06 00:00:00,2019-02-07 00:00:00,2019-02-10 00:00:00,2019-02-11 00:00:00,2019-02-12 00:00:00,2019-02-13 00:00:00,Total Diesel
Name,,,,,,,,,,
Total,43500.0,3000.0,32000.0,30000.0,21000.0,32000.0,38000.0,36500.0,30000.0,266000.0

In [46]:
pivot_diesel.iloc[1:, 9]

Name
aarif        12000.0
aashu         1500.0
amjad         7000.0
farookh       9000.0
gulfam       10000.0
hasan        12500.0
haseen       15000.0
irsad         8000.0
isran        12500.0
jabir        15000.0
khurseed     11300.0
momin        10270.0
mustakim      9000.0
noushad      47670.0
poclain      27760.0
rafakat       4000.0
rasid         8500.0
sabir jcb    10000.0
sanjay        2500.0
shabir        4500.0
shokeen       7000.0
toheed        9500.0
wajid        11000.0
Name: Total Diesel, dtype: float64

In [40]:
sum(pivot_diesel.iloc[1:, 9])

265500.0

In [56]:
diesel = pd.DataFrame(pivot_diesel.iloc[1:, 9])
diesel

           Total Diesel
Name
aarif           12000.0
aashu            1500.0
amjad            7000.0
farookh          9000.0
gulfam          10000.0
hasan           12500.0
haseen          15000.0
irsad            8000.0
isran           12500.0
jabir           15000.0
khurseed        11300.0
momin           10270.0
mustakim         9000.0
noushad         47670.0
poclain         27760.0
rafakat          4000.0
rasid            8500.0
sabir jcb       10000.0
sanjay           2500.0
shabir           4500.0
shokeen          7000.0
toheed           9500.0
wajid           11000.0

In [0]:
diesel.reset_index(inplace = True)

In [59]:
diesel.head(1)

    Name  Total Diesel
0  aarif       12000.0

In [50]:
name_total_quantity.shape

(20, 2)

In [51]:
diesel.shape

(23, 1)

In [0]:
final = pd.DataFrame(columns = ['Name','Count' , 'Total Quantity', 'Amount', 'Diesel', 'Amount - Diesel'])
for i in range(len(name_total_quantity)):
  for j in range(len(diesel)):
    if name_total_quantity.Name[i] == diesel.Name[j]:
      final = final.append({'Name': diesel.Name[j],'Total Quantity':name_total_quantity['Total Quantity'][i] ,
                            'Count':rounds_per_name.get(diesel.Name[j]),
                            'Amount':name_total_quantity['Total Quantity'][i]*3,
                            'Diesel':diesel['Total Diesel'][j],
                            'Amount - Diesel':name_total_quantity['Total Quantity'][i]*3 - diesel['Total Diesel'][j]},
                           ignore_index = True)

In [70]:
final.sort_values(by = 'Total Quantity', ascending = False, inplace = True)
final

        Name Count Total Quantity Amount   Diesel  Amount - Diesel
9      jabir    25          10455  31365  15000.0          16365.0
6     haseen    20           9920  29760  15000.0          14760.0
10  khurseed    21           9515  28545  11300.0          17245.0
5      hasan    16           8588  25764  12500.0          13264.0
8      isran    17           7990  23970  12500.0          11470.0
0      aarif    17           7072  21216  12000.0           9216.0
11     momin    17           7045  21135  10270.0          10865.0
14     rasid    16           6540  19620   8500.0          11120.0
17    toheed    15           6215  18645   9500.0           9145.0
12  mustakim    15           6075  18225   9000.0           9225.0
3    farookh    13           5460  16380   9000.0           7380.0
18     wajid    13           5437  16311  11000.0           5311.0
16   shokeen    11           4983  14949   7000.0           7949.0
4     gulfam    10           4980  14940  10000.0           4940.0
2      amjad    12           4932  14796   7000.0           7796.0
7      irsad     9           3875  11625   8000.0           3625.0
13   rafakat     4           2152   6456   4000.0           2456.0
15    shabir     3           1410   4230   4500.0           -270.0
1      aashu     2            860   2580   1500.0           1080.0

In [71]:
final.shape

(19, 6)

# Total payable

In [76]:
our_amount = total_quantity*4.25
our_amount

511653.25

In [77]:
total_diesel

266000.0

# Our Balance

In [79]:
balance = our_amount - total_diesel
balance

245653.25

# Tot People

In [80]:
to_people = sum(final['Amount - Diesel'])
to_people

162942.0

# Profit

In [83]:
noushad = pivot_diesel.loc['noushad']['Total Diesel']
noushad

47670.0

In [84]:
balance - to_people + noushad

130381.25

# Total Diesel to peoples

In [0]:
sum(final['Diesel'])

269330

In [0]:
to_tractors = sum(final['Total Quantity'])
to_tractors

173983

In [0]:
to_tractors + name_total_quantity[name_total_quantity.Name == 'mehmood']['Total Quantity']

14    177620
Name: Total Quantity, dtype: object